load_tests/pre-commit.yml
#!/usr/local/bin/bzt
---

included-configs:
- scenario-home-page.yml
- scenario-reservation.yml 

scenarios:
  pre-commit:
    default-address: http://localhost:8000
    requests:
    - include-scenario: home-page
    - include-scenario: reservation

execution:
  concurrency: 1
  hold-for: 30s
  ramp-up: 0
  scenario: pre-commit