load_tests/staging.yml
#!/usr/local/bin/bzt --option=modules.console.disable=true
---

included-configs:
- ../functional_tests/Taurus/scenario-home-page.yml
- ../functional_tests/Taurus/scenario-reservation.yml 

scenarios:
  staging:
    default-address: http://54.210.176.248:8000
    requests:
    - include-scenario: home-page
    - include-scenario: reservation

execution:
  concurrency: 30
  hold-for: 3m
  ramp-up: 3m
  scenario: staging

services:
- module: passfail
  criteria:
  - avg-rt of Home>150ms for 10s, stop as failed
  - fail of Home>1% for 10s, stop as failed
  - avg-rt of reservation>5s for 10s, stop as failed
  - fail of reservation>10% for 10s, stop as failed